ProgrammingTestTask-1/src/Documents/Приходная/Приходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приходная</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСрокаГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ProgrammingTestTask-1/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеСрокаГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ProgrammingTestTask-1/src/Documents/Приходная/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.ОкончаниеСрокаГодности < Дата Тогда
			СообщитьОбОшибке(ТекСтрокаТовары);
			Отказ = Истина;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары);
		
	КонецЦикла;

КонецПроцедуры

Процедура СообщитьОбОшибке(Знач ТекСтрокаТовары)
	
	Перем Сообщение;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Нельзя оприходовать товар с истекшим сроком годности";
	Сообщение.Поле = "Товары[" + (ТекСтрокаТовары.НомерСтроки - 1) + "].ОкончаниеСрокаГодности";
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
